const 烹饪 = {
	"鸡蛋面": {
		"鸡蛋": 2,
		"面粉": 2
	},
	"蛋炒饭": {
		"水稻": 2,
		"鸡蛋": 2
	},
	"麻婆豆腐": {
		"豆腐": 1,
		"辣椒": 2
	},
	"蛋黄酥": {
		"面粉": 1,
		"鸡蛋": 2,
		"糖": 1
	},
	"清汤白菜": {
		"白菜": 5
	},
	"麻花": {
		"面粉": 2,
		"糖": 1
	},
	"酸菜豆腐": {
		"豆腐": 1,
		"酸菜": 1
	},
	"辣子鸡丁": {
		"鸡肉": 1,
		"辣椒": 2
	},
	"鲫鱼豆腐汤": {
		"鲫鱼": 1,
		"豆腐": 1
	},
	"酸菜鱼": {
		"酸菜": 1,
		"黑鱼": 1,
		"辣椒": 2
	},
	"鸡肉豆腐": {
		"鸡肉": 1,
		"豆腐": 1
	},
	"酸菜氽白肉": {
		"猪肉": 1,
		"酸菜": 1
	},
	"虎皮肉": {
		"猪肉": 1,
		"糖": 1
	},
	"剁椒鱼头": {
		"胖头鱼": 1,
		"辣椒": 3
	},
	"肉末烧饼": {
		"猪肉": 1,
		"面粉": 2
	},
	"酸辣土豆丝": {
		"土豆": 2,
		"辣椒": 3
	},
	"苦瓜炒蛋": {
		"苦瓜": 2,
		"鸡蛋": 3
	},
	"荠菜肉包": {
		"面粉": 1,
		"猪肉": 1,
		"荠菜": 2
	},
	"苦瓜猪肉汤": {
		"猪肉": 1,
		"苦瓜": 2
	},
	"红烧鸭": {
		"鸭肉": 1,
		"辣椒": 3
	},
	"香椿拌豆腐": {
		"豆腐": 1,
		"香椿": 2
	},
	"松鼠鳜鱼": {
		"鳜鱼": 1,
		"糖": 1
	},
	"荠菜馄饨": {
		"面粉": 1,
		"猪肉": 1,
		"荠菜": 2
	},
	"黄焖鸡": {
		"辣椒": 2,
		"鸡肉": 1,
		"土豆": 1,
		"香菇": 1
	},
	"苦瓜拌面": {
		"面粉": 2,
		"苦瓜": 2
	},
	"酸菜羊肉": {
		"羊肉": 1,
		"酸菜": 1
	},
	"银鱼南瓜羹": {
		"银鱼": 1,
		"南瓜": 3
	},
	"糖醋里脊": {
		"猪肉": 1,
		"糖": 1
	},
	"香辣羊肉面": {
		"面粉": 2,
		"羊肉": 1,
		"辣椒": 2
	},
	"鱼香肉丝": {
		"辣椒": 1,
		"猪肉": 1,
		"木耳": 2
	},
	"木须肉": {
		"鸡蛋": 2,
		"猪肉": 2,
		"木耳": 1
	},
	"蚂蚁上树": {
		"粉丝": 1,
		"猪肉": 1,
		"辣椒": 2,
		"糖": 1
	},
	"粉丝蒸白菜": {
		"白菜": 3,
		"粉丝": 1
	},
	"狮子头": {
		"面粉": 1,
		"猪肉": 2,
		"鸡蛋": 1,
		"糖": 1
	},
	"羊肉泡馍": {
		"辣椒": 2,
		"羊肉": 1,
		"粉丝": 1,
		"面粉": 1
	},
	"南瓜馒头": {
		"南瓜": 3,
		"面粉": 1,
		"糖": 1
	},
	"赛螃蟹": {
		"青鱼": 1,
		"鸡蛋": 2
	}
}